app/controllers/articles_controller.rb

	def index
		#Obtiene todos los registros de la tabla de la base de datos article
		@articles =	Article.all
---
SELECT "articles".* FROM "articles"

	def show
		#Encontrar un registro por id
		@article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 0]]

	def create
		#INSERT TO
		#Ootra forma de colocarlo
		#@article = Article.new(title: params[:article][:title], body: params[:article][:body])
		@article = Article.new(article_params)
		if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Tercer Articulo"], ["body", "Tercer Articulo"], ["created_at", "2017-11-17 14:45:55.072624"], ["updated_at", "2017-11-17 14:45:55.072624"]]

	def update
		#UPDATE
		# @article.update_attributes({title: 'Nuevo titulo'})
		@article = Article.find(params[:id])
		if @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["body", "articulo calidad MEJORADO !!!!"], ["updated_at", "2017-11-17 20:08:15.751563"], ["id", 1]]

	def destroy
		#DELETE FROM ARTICLE
		@article = Article.find(params[:id])
		@article.destroy #Elimina el objeto en la DB
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 5]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 5]]